Table of Contents
 Class OpenModelResult
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
Results of open model
public class OpenModelResult
Inheritance
object
OpenModelResult
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 OpenModelResult()
Constructor
public OpenModelResult()
Properties
 ResultOnMembers
Results on members
public List<ResultOnMembers> ResultOnMembers { get; set; }
Property Value
List<ResultOnMembers>
Methods
 LoadFromStream(Stream)
Creates the instance of Open Model Result from the stream
public static OpenModelResult LoadFromStream(Stream xmlFileStream)
Parameters
xmlFileStream Stream
The input stream
Returns
OpenModelResult
The new instance of Open Model Result
 LoadFromXmlFile(string)
Creates the instance of Open Model Result from the XML file
public static OpenModelResult LoadFromXmlFile(string xmlFileName)
Parameters
xmlFileName string
XML file name
Returns
OpenModelResult
Open Model Result or null
 SaveToXmlFile(string)
Saves content into file as a XML format
public bool SaveToXmlFile(string xmlFileName)
Parameters
xmlFileName string
XML file name
Returns
bool
True if succeeded
 Edit this page